# 1. INTRODUCTION

* Python has gathered alot of appreciation as a choice of language for Data Analytics. Open Source and Free to install.
* Awesome online community.
* Very easy to learn.
* It can become common language for data science.
* It can also become a common language for production of web based analytics products. As it is interpreted programming language so it is easier to implement.
* Compilation is not required, execution process can be done directly.

# 2. Data Types

Following data types are used in Python to store and access the data. Those are explained below.

# 2.1 Variables

* In Python, variables don't need explicit declaration to occupy memory space. 
* The type of the variable will be decided after assigning the value to it.

Some examples are given as follows:

In [2]:
counter = 240.20 #float type variable
miles = 990 #integer type variable
name = "Umair Ahmed" #string type variable
#print all values
print (counter)
print (miles)
print (name)

240.2
990
Umair Ahmed

In [8]:
Salary = 50000.50 #float type variable
Year = 2019 #integer type variable
Name = "Jafeel" #string type variable
#print all values
print (Salary)
print (Year)
print (Name)

50000.5
2019
Jafeel

In [9]:
Economy = 15000.1350 #float type variable
Year = 1947 #integer type variable
Country = "Pakistan" #string type variable
#print all values
print (Economy)
print (Year)
print (Country)

15000.135
1947
Pakistan

# 2.2 Numbers

* This data type stores numeric values.
* They are immutable data types (Means changing the value of Number data type will results in a newly allocated object).

Some examples are given below

In [11]:
2 #Interger_Type

2

In [12]:
2+7 #Integer_Addition

9

In [13]:
2.5*2 #Fload_Multiplication

5.0

In [14]:
2**2 #Exponential_Equation

4

In [15]:
4**2 #Exponential_Equation

16

# 2.3 Strings

* String data types are used to store words or combination of words having letters, numbers, special characters etc.
* It can be stored by enclosing within single qoutes and double qoutes also.
* Python doesn't support char data type. It will be as String of length one in Python.

Some Example Are Following

In [17]:
name = 'Jafeel'
university = "Superior"
print(name,university)

Jafeel Superior

In [20]:
profession = "MERN Stack Developer"
print(name, 'Is', profession,"and studying from",university<"University")

Jafeel Is MERN Stack Developer and studying from True

In [21]:
age = 19
print(name,"age is",age)

Jafeel age is 19

### Acess values in String

* Python doesn't support Character data type. These are treated as Strings of length one. 
* Square brackets are used to access substrings.
* We can access a specific character or range of characters from string.
It would be cleared by using following examples.

In [22]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

In [32]:
newString = 'Pakistan'
print(newString[0:3])

Pak

In [36]:
print(newString[0:3], stringVariable[6:11])

Pak World

### Updating String

* Value of the string can be updated by assigning a new value to it.
* New value will be replaced with older. New value must be related (having same data type) to previous value of the string.
* '+' operator will be used for this purpose like as follows:

In [40]:
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  UNITEDPython

In [38]:
stringVariable = 'Zindabad'
print(Country,stringVariable)

Pakistan Zindabad

In [39]:
Country = "USA"
stringVariable = "UNITED STATE AMERICA"
print(Country, stringVariable)

USA UNITED STATE AMERICA

### Delete String

* To delete the value of the string, just delete its object (reference variable). 

See following example:

In [47]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

In [48]:
Country = "PAKISTAN"
print (Country)
del stringVariable
print (stringVariable)

PAKISTAN

NameError: name 'stringVariable' is not defined

In [50]:
DATA = 324
print(DATA)
del DATA
print(DATA)

324

NameError: name 'DATA' is not defined

### String special operators

Some special operators are used in Python to assist the user. These are given below.

* '+' operator is used for concatenation.

Example :

In [53]:
Hello = "Hello"
World = "World"
print(Hello+World)

HelloWorld

In [54]:
print(Hello+"New"+World)

HelloNewWorld

In [56]:
print("Superior"+" "+"University")

Superior University

* '*' used of Repetition

In [58]:
print(Hello*3)

HelloHelloHello

In [60]:
print('22'*3)

222222

In [61]:
print(World*10)

WorldWorldWorldWorldWorldWorldWorldWorldWorldWorld

* '[]' give the character of string at given index.
* Index Should Start From 0.

Example

In [62]:
NewVariable = "abcd"
print(NewVariable[0])

a

In [63]:
print(NewVariable[3])

d

In [64]:
print(NewVariable[3],NewVariable[1])

d b

* '[:]' is used to get a range of characters from string.

Example

In [66]:
print(NewVariable[0:3])

abc

In [67]:
newString = 'Pakistan'
print(newString[0:3])

Pak

In [69]:
print(newString[0:3],"Zindabad")

Pak Zindabad

* 'in' returns true if given character exists in string, otherwise false.
* And this method is case sensitive

Example

In [71]:
print('P' in newString)

True

In [72]:
print("m" in newString)

False

In [73]:
print("p" in newString)

False

* 'not' return opposite value of method
* And this method is case sensitive

Example

In [74]:
print("P" not in newString)

False

In [75]:
print("p" not in newString)

True

In [76]:
print("i" not in newString)

False

### String formatting operator

* One of the coolest feature is string formatting operator within print statement.
* It is represented by % sign inside a string
* %s - String (or any object with a string representation, like numbers)
* %d - Integers
* %f - Floating point numbers
* %.<number of digits>f - Floating point numbers with a fixed amount of digits to the right of the dot.
* %x/%X - Integers in hex representation (lowercase/uppercase)

Example

In [78]:
 print ("My name is %s and age is %d kg!" % ("Jafeel",51))

My name is Jafeel and age is 51 kg!

In [79]:
country = "Pakistan"
print("I live in %s"%(country))

I live in Pakistan

In [81]:
age = 19
print("My age is %d"%(age))

My age is 19

# 2.4 Lists

* It can be written as a list of comma-seperated values within square brackets. 
* Multiple types of data can be stored in a List.
* Individual elements of a list can be changed (it can be read and write).
* List indices starts from 0 just like arrays.

Example

In [82]:
FirstList = ["Jafeel","Superior"]
print(FirstList)

['Jafeel', 'Superior']

In [83]:
NumberList=[1,5,4]
print(NumberList)

[1, 5, 4]

In [85]:
List=[1,"22","true",19]
print(List)

[1, '22', 'true', 19]

##### We Used List For Storing Multiple Items

##### List Is Helpful when we have large amount of data

##### Like Stundent's Record

In [86]:
List = ["Jafeel","Shahroz","Naveed"]
print(List)

['Jafeel', 'Shahroz', 'Naveed']

### Accessing values in Lists

* Square brackets are used to access the values of a list.
* We can access a specific values or range of values from list.

Example

In [88]:
print(List[0])

Jafeel

In [90]:
print(List[2])

Naveed

In [91]:
print(List[0:2])

['Jafeel', 'Shahroz']

### Updating Lists

* We can update single or mupltiple elements of a list by giving slice on left hand of the assignment operator. 
* It can also be updated using append() function.

Example

In [92]:
List[0] ="ALI HASSAN"

In [93]:
print(List)

['ALI HASSAN', 'Shahroz', 'Naveed']

In [94]:
print(List.append("CS"))

None

In [95]:
print(List)

['ALI HASSAN', 'Shahroz', 'Naveed', 'CS']

### Delete List element

* del statement is used to remove when you know the position or index of element to be deleted.
* remove() function can be used when you don't know the position of element to be removed.

In [5]:
List = ["Jafeel","Shahroz","Naveed"]
print (List)
del List[0];
print ("After deleting value at index 0 : ")
print (List)

['Jafeel', 'Shahroz', 'Naveed']
After deleting value at index 0 :
['Shahroz', 'Naveed']

#### To clean all list we used clear()

In [7]:
List.clear()
print(List)

[]

In [8]:
List = ["Pakistan","India","Afghanistan","Turky"]
print(List)
print("After Deleting India")
List.remove("India")
print(List)

['Pakistan', 'India', 'Afghanistan', 'Turky']
After Deleting India
['Pakistan', 'Afghanistan', 'Turky']

In [9]:
print(List)
print("After Deleting Afghanistan")
List.remove("Afghanistan")
print(List)

['Pakistan', 'Afghanistan', 'Turky']
After Deleting Afghanistan
['Pakistan', 'Turky']

# 2.5 Dictionaries

* It is same as array of objects having key and values in PHP. Each key is seperated by colon (:) from its value.
* Each item is seperated with comma (,).
* Empty dictionary can be written as {}.
* Keys are unique in dictionary but values may not.
* The values of the dictionary can be of any data type.
* The keys must be of an immutable data type such as strings, numbers, or tuples.

Example

In [12]:
Dic = {"name":"Jafeel","Roll_No":324,"Semester":3}
print(Dic)

{'name': 'Jafeel', 'Roll_No': 324, 'Semester': 3}

##### We Used Dictionaries When We Have Large Amount Of Group Of Data

##### We Used it because it is to make a record of specific format

##### It help like enum type

### Accessing value in Dictionary

* We can use the familiar square brackets along with the key to obtain its value.

Following is a simple example

In [14]:
print(Dic["name"])

Jafeel

In [16]:
print("Name Is",Dic["name"],"Roll No Is",Dic["Roll_No"],"And Semester Is",Dic["Semester"])

Name Is Jafeel Roll No Is 324 And Semester Is 3

In [21]:
NewDic = [3,4,8,9,10]
print("Sum Of Dictionaries")
Temp = NewDic[0]+NewDic[1]+NewDic[2]+NewDic[3]+NewDic[4]
print(Temp)

Sum Of Dictionaries
34

### Updating Dictionary

* We can update already existing value in dictionary.
* We can also add a new entry in dictionary.

See Examples :

In [23]:
dict = {'Name':"Jafeel", 'Depart': "BSCS", 'Batch': 2018}
print (dict)
dict['Batch'] = "F18"
print (dict)
dict['University'] = "Superior Gold Campus"
print(dict)

{'Name': 'Jafeel', 'Depart': 'BSCS', 'Batch': 2018}
{'Name': 'Jafeel', 'Depart': 'BSCS', 'Batch': 'F18'}
{'Name': 'Jafeel', 'Depart': 'BSCS', 'Batch': 'F18', 'University': 'Superior Gold Campus'}

In [27]:
NewDic = {"Country":"Pakistan","Population":"22Cr","State":4}
print(NewDic)
NewDic["Population"] = "23Cr"
print(NewDic)
NewDic["Capital"]="Isl"
print(NewDic)

{'Country': 'Pakistan', 'Population': '22Cr', 'State': 4}
{'Country': 'Pakistan', 'Population': '23Cr', 'State': 4}
{'Country': 'Pakistan', 'Population': '23Cr', 'State': 4, 'Capital': 'Isl'}

In [28]:
NewDic["State"] = 5
print(NewDic)

{'Country': 'Pakistan', 'Population': '23Cr', 'State': 5, 'Capital': 'Isl'}

### Delete Dictionary Element

* We can delete individual element of dicitionary and complete content of dictionary.
* del is used for individual element removal and clear() function is used to remove entire dictionary.

Example

In [30]:
print(NewDic)
del NewDic
print(NewDic)

{'Country': 'Pakistan', 'Population': '23Cr', 'State': 5, 'Capital': 'Isl'}

NameError: name 'NewDic' is not defined

In [32]:
NewDic = {"Country":"Pakistan","Population":"22Cr","State":4}
print(NewDic)
NewDic.clear()
print(NewDic)

{'Country': 'Pakistan', 'Population': '22Cr', 'State': 4}
{}

In [36]:
NewDic = {"Country":"Pakistan","Population":"22Cr","State":4}
print(NewDic)
del NewDic
NewDic = {}
print(NewDic)

{'Country': 'Pakistan', 'Population': '22Cr', 'State': 4}
{}

# 2.6 Tuples

* It is same as list. The differences between tuples and lists are, the tuples cannot be changed.
* Each item is comma (,) seperated.
* Empty Tuple is shown as ().
* To write a tuple containing a single value you have to include a comma (,) even though there is only one value. For Exampe: tup = (40,). It can also have multiple data type values.
* Like string indices, tuple indices start at 0, and they can be sliced, concatenated, and so on.

##### We Use tuple when data is immutable
##### Tuple grouping and organizing data to make it easier to use.
##### Tuple is Composability of Data Structures

In [37]:
# An empty tuple 
empty_tuple = () 
print (empty_tuple)

()

In [39]:
# Creating non-empty tuples 
  
# One way of creation 
tup = 'python', 'geeks'
print(tup) 
  
# Another for doing the same 
tup = ('python2', 'geeks2') 
print(tup)

('python', 'geeks')
('python2', 'geeks2')

In [40]:
# Code for concatenating 2 tuples 
  
tuple1 = (0, 1, 2, 3) 
tuple2 = ('python', 'geek') 
  
# Concatenating above two 
print(tuple1 + tuple2)

(0, 1, 2, 3, 'python', 'geek')

### Accessing values in Tuples

* We can use the familiar square brackets along with the index to obtain its value. 

Following is a simple example

In [41]:
tup = ('L.A','88', 'OOP', '92')
print (tup)
print(tup[1])
print(tup[1:3])

('L.A', '88', 'OOP', '92')
88
('88', 'OOP')

In [46]:
print(tup[1])

88

In [45]:
# Code to create a tuple with repetition 
tuple3 = ('python',)*3
print(tuple3)

('python', 'python', 'python')

### Updating Tuples

* Tuples are immutable means we can't change it. 
* It is read only. We are able to take portions of tuples to make a new tuple.

Example

In [48]:
#code to test that tuples are immutable 
  
tuple1 = (0, 1, 2, 3) 
tuple1[0] = 4
print(tuple1)

TypeError: 'tuple' object does not support item assignment

In [47]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');
# Following action is not valid for tuples
# tup1[0] = 100;
# So let's create a new tuple as follows
tup3 = tup1 + tup2;
print (tup3);

(12, 34.56, 'abc', 'xyz')

### Delete Tuple elements

* Removing individual element in Tuple is not possible because they can't be updated.
* del statment is used to remove entire Tuple.

Example

In [49]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

In [55]:
tup = ("Jafeel","Superior","Gold Campus")
print(tup)
del tup
print(tup)

('Jafeel', 'Superior', 'Gold Campus')

NameError: name 'tup' is not defined

# 2.7 Sets

* A set is collection of unordered items.
* Every element is unique (No duplicates).
* Every element is immutable (can't be changed).
* However, the set itself is mutable. We can add or remove items from it.
* Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc. Empty set will be written as {}.
* Each item in set will be comma (,) seperated.
* We can make a set from a list using set() function.
* Data type can be found using type() function.
* add() is used to add single value, update() is used for adding multiple values.
* update() function can take tupe, strings, list or other set as argument. In all cases, duplicates will be avoided. discard() and remove() are used to to delete particular item from set.
* discard() will not raise an error if item doesn't exists in set.
* remove() will raise an error if item doesn't exists in set.

Example


##### Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc.
##### Use a set if you need uniqueness for the elements.
##### if what we need is to remove duplicates, or do mathematical operations like combining lists (unions), we can, and SHOULD always use Sets.

In [59]:
# Python program to demonstrate differences 
# between normal and frozen set 
  
# Same as {"a", "b","c"} 
normal_set = set(["a", "b","c"]) 
  
# Adding an element to normal set is fine 
normal_set.add("d") 
  
print("Normal Set") 
print(normal_set)

Normal Set
{'c', 'd', 'a', 'b'}

In [60]:
#list
list1 = [1,2,3,4,5]
print (type(list1))
my_set = set(list1)
print(my_set)
print (type(my_set))
# set of integers
my_set = {1,2,3}
print (my_set)
# set of mixed data types
my_set = {1,"Hello", 1.2,'C'}
# adding a single value
my_set.add('D')
#adding multiple values
my_set.update(list1)
print (my_set)
my_set.discard('G') # it will not raise an error

<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>
{1, 2, 3}
{1, 1.2, 2, 3, 4, 5, 'D', 'C', 'Hello'}

In [1]:
# set of integers
my_set = {1, 2, 3}
print(my_set)

# set of mixed datatypes
my_set = {1.0, "Hello", (1, 2, 3)}
print(my_set)

{1, 2, 3}
{1.0, (1, 2, 3), 'Hello'}

# 3. Comparison Operators

* These are used to compare values (string or numbers) and return true/false according to situation.

Some Operator Are Following:

* Less Than <
* Greater Than >
* Comparison ==
* Not Operator !
* or operator 
* and operator

Example

In [3]:
1<10

True

In [4]:
10<4

False

In [5]:
5>3

True

In [6]:
5>10

False

In [7]:
2 == 2

True

In [8]:
2 == 3

False

In [9]:
2 != 9

True

In [43]:
5 !=5

False

In [12]:
(3 == 3) or (3 != 10)

True

In [13]:
a = 10
b=5
(a==a) or (a == b)

True

In [14]:
(1==1) and (1!=20)

True

In [15]:
a = 10
b=5
(a==a) or (a == b)

True

# 4. If-Else Statements

* If-Else statments are used to execute a block of code depending on conditions. If block if condition is true otherwise else block. 

See following example:

In [19]:
if 2 == 2:
    print("True")
else:
    print("False")

True

In [20]:
a = 10
if a%2 == 0:
    print("Even")
else : 
    print("Odd")

Even

In [21]:
b = 12
if a == b:
    print("A And B Both Are Same")
else :
    print("A And B Both Are Not Same")

A And B Both Are Not Same

# 5. For and While Loop

* Python has for and while loop for iteration, used when we want to perform a specific a task repeatedly.

### For Loop Example

In [23]:
#example of for loop fact = 1
Number=5
fac=1
for i in range (1,Number+1):
    fac*=i
print (fac)

120

In [33]:
for i in range(10):
    for k in range(i):
        print(i,end =" ")
    print(" ")

1
2 2
3 3 3
4 4 4 4
5 5 5 5 5
6 6 6 6 6 6
7 7 7 7 7 7 7
8 8 8 8 8 8 8 8
9 9 9 9 9 9 9 9 9

In [35]:
for i in range(10):
    for k in range(i):
        print("*",end =" ")
    print(" ")

*
* *
* * *
* * * *
* * * * *
* * * * * *
* * * * * * *
* * * * * * * *
* * * * * * * * *

### While Loop Example

In [44]:
i = 1
while i < 6:
  print(i)
  i += 1

1
2
3
4
5

In [56]:
a =20
i =1;
while i<=a:
    print(i, end=" ")
    i = i +1

1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20

# 6. Functions

* It is a block of organized and reusable code.
* It is used to perform a single, related action.
* It provides high modularity for your application. It has a hight degree of code reusing.
* The syntax is:

  def functionname( parameters ):
  
  "function_docstring"
  
  function_suite
  
  return [expression]

In [ ]:
# Function definition is here
def printme( str ):
 #This prints a passed string into this function
    print (str)
    return;
# Now you can call printme function
printme("I'm first call to user defined function!")

In [63]:
def evenorodd(int):
    if int%2 == 0:
        return "even";
    else:
        return "odd";

print("Number is ",evenorodd(2))

Number is  even

In [67]:
def fac(int):
    fac = 1
    for i in range(1,int+1):
        fac*=i
    return fac

print("Factorial",fac(5))

Factorial 120

# 7. Lambda Functions

* The creation of anonymous functions at runtime, using a construct called "lambda".
* Lambda function doesn't include return statement, it always contains an expression which is returned.
* This piece of code shows the difference between a normal function definition ("f") and a lambda function ("g"):

Example

In [68]:
#Normal function
def f (x):
    return x**2
print (f(3))

9

In [70]:
#Lambda Function
#lambda expressions
times3 = lambda var:var*3
print(times3(10))
#lambda expressions: another way to write a function in line

30

In [72]:
good = lambda name : "Good Morning Dear " + name
print(good("Jafeel"))

Good Morning Dear Jafeel

### 7.1 Map()

* Map() function is used with two arguments. Just like: r = map(func, seq)
* The first argument func is the name of a function and the second a sequence (e.g. a list).
* seq. map() applies the function func to all the elements of the sequence seq. It returns a new list with the elements changed by func.

Example

In [73]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)
lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

In [81]:
def myfunc(a, b):
  return a + b

x = map(myfunc, ('apple', 'banana', 'cherry'), ('orange', 'lemon', 'pineapple'))

print(x)

#convert the map into a list, for readability:
print(list(x))

<map object at 0x106ab3240>
['appleorange', 'bananalemon', 'cherrypineapple']

In [82]:
name = "Jafeel, Ali, Shahroz, Naveed, Bilal, Faiz, Wasif"
student = name.split(", ")
print(student)
total = map(lambda student: len(student),student)
list(total)

['Jafeel', 'Ali', 'Shahroz', 'Naveed', 'Bilal', 'Faiz', 'Wasif']

[6, 3, 7, 6, 5, 4, 5]

### 7.2 Filter()

* The function filter(function, list) offers an elegant way to filter out all the elements of a list.
* The function filter(f,l) needs a function f as its first argument. f returns a Boolean value, i.e. either True or False. 
* This function will be applied to every element of the list l.
* Only if f returns True will the element of the list be included in the result list.

Example

In [84]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
print("Odd Number",list(result1))

Odd Number [1, 1, 3, 5, 13, 21, 55]

In [87]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2 ==0, fib)
print("Even Number",list(result1))

Even Number [0, 2, 8, 34]

In [88]:
ages = [5, 12, 17, 18, 24, 32]

def myFunc(x):
  if x < 18:
    return False
  else:
    return True

adults = filter(myFunc, ages)

for x in adults:
  print(x)

18
24
32

# 8. File I/O

* In this section, we'll cover all basic I/O function(methods).

### 8.1 Reading input from Keyboard

* For reading input from keyboard, raw_input() method is used.
* It reads only one line from standard input and returns it as a string.

Example

In [90]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name: Jafeel
Jafeel

In [94]:
age = input("Enter Age Here ")
if int(age) < 18 :
    print("You Are Not Eligible")
else :
    print("You Are Eligible")

Enter Age Here 18
You Are Eligible

### 8.2 I/O from or to Text File

* In this scenario, we'll read and write to a text file. r opens a file in read only mode.
* r+ opens a file read and write mode.
* w opens a file in write mode only.
* a opens a file in append mode
* a+ opens a file in append and read mode.

In [100]:
# Open a file to read
fileOpen = open("file.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (str)
# Close opend file
fileOpen.close()

Name: Jafeel Waheed
Semester: 3rd
Department: BSCS
University: Superior University

In [108]:
# Open a file to read
fileOpen = open("result.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print ("Result","\n"+str)
# Close opend file
fileOpen.close()

Result
OOP : 86
MVC : 91
Discrete : 70
Isl : 80
Pak Study : 75
Technical : 76

In [109]:
# Open a file to read
fileOpen = open("gpa.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print ("GPA","\n"+str)
# Close opend file
fileOpen.close()

GPA
SGPA 1 : 3.6
SGPA 2 : 3.55
CGPA : 3.58

In [104]:
# Open a file to append
fileOpen = open("file.txt", "a+")
fileOpen.write("\nAge: 18");
fileOpen.close()
# Open a file to read
fileOpen = open("file.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (string)
# Close opend file
fileOpen.close()

Name: Jafeel Waheed
Semester: 3rd
Department: BSCS
University: Superior University
Age: 18

In [110]:
# Open a file to append
fileOpen = open("result.txt", "a+")
fileOpen.write("\nPF: 92");
fileOpen.close()
# Open a file to read
fileOpen = open("result.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (string)
# Close opend file
fileOpen.close()

OOP : 86
MVC : 91
Discrete : 70
Isl : 80
Pak Study : 75
Technical : 76
PF: 92

In [111]:
# Open a file to append
fileOpen = open("gpa.txt", "a+")
fileOpen.write("\nSGPA 3: 3.85");
fileOpen.close()
# Open a file to read
fileOpen = open("gpa.txt", "r+")
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file
print (string)
# Close opend file
fileOpen.close()

SGPA 1 : 3.6
SGPA 2 : 3.55
CGPA : 3.58
SGPA 3: 3.85

### 8.3 File Position

* tell() method tells the currenct position within the file. 
* seek() method changes the current file location.

Example

In [115]:
# Open a file
fo = open("file.txt", "r+")
str = fo.read(10);
print ("Read String is : \n", str)
# Check current position
position = fo.tell();
print ("Current file position : \n", position)
# Reposition pointer at the beginning once again
position = fo.seek(0, 0);
str = fo.read(20);
print ("Again read String is : \n", str)
# Close opend file
fo.close()

Read String is :
 Name: Jafe
Current file position :
 10
Again read String is :
 Name: Jafeel Waheed

In [118]:
# Open a file
fo = open("gpa.txt", "r+")
str = fo.read(12);
print ("SGPA 1 : \n", str)
# Check current position
position = fo.tell();
# Reposition pointer at the beginning once again
position = fo.seek(0, 0);
str = fo.read(24);
print ("Again read String is : \n", str)
# Close opend file
fo.close()

SGPA 1 :
 SGPA 1 : 3.6
Again read String is :
 SGPA 1 : 3.6
SGPA 2 : 3.

In [119]:
import os
# rename a file
os.rename("file.txt", "newfile.txt")

In [120]:
import os
# rename a file
os.rename("newfile.txt", "file.txt")

In [121]:
import shutil
# Duplicate File
shutil.copy('file.txt', 'duplicate.txt')

'duplicate.txt'

In [122]:
#remove file
os.remove("duplicate.txt")

# 9. Pandas Introduction

* Pandas is an open source library built on top of NumPy
* It allows for fast analysis and data cleaning and preparation It excels in proformance and productivity
* It also has built-in visualization features
* It can work with data from a wide variety of sources

# 10. Series

* A series is very similar to NumPy array.
* Series is 1-D array labeled array capable of holding any type of data.
* The difference between the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location
* The axis labels are collectively referred to as the index.
* Following function is used to create a series:
s= pd.Series(data,index = index)
* In above function, data can be many different things:
* A python dict
* An ndarray
* A scalar value (For exmple: 5)
* The passed index is a list of axis labels. So, this seperates into a few cases depending on what data is:

##### We Used Pandas Series When We want two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).
##### It used for data frames
##### It helpfull for data structing of CSV, pdf, Sql table etc

In [123]:
# import pandas as pd
import pandas as pd
 
# import numpy as np
import numpy as np
 
# simple array
data = np.array(['g','e','e','k','s'])
 
ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [124]:
# a simple list
list = ['g', 'e', 'e', 'k', 's']
  
# create series form a list
ser = pd.Series(list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [126]:
# creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,22])
  
  
# accessing a element using index element
print(ser[16])

o

### 10.1 From ndarray

* If data is an ndarray, index must be the same length as data.
* If no index is passed, one will be created having values [0, ..., len(data) - 1].

In [130]:
import matplotlib.pyplot as plt
"""following a fucntion is called from panas to create a series.
   data would be 5 random values and indexes are assigned a-e"""
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    0.515732
b    0.703918
c    1.569997
d   -1.047106
e   -0.519497
dtype: float64

In [131]:
"""Following function will print the index and its datatype"""
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [132]:
data = np.array(['a', 'b', 'c', 'd', 'e']) 
  
# creating series 
s = pd.Series(data, index =[1000, 1001, 1002, 1003, 1004]) 
print(s)

1000    a
1001    b
1002    c
1003    d
1004    e
dtype: object

In [134]:
"""Following function will print the index and its datatype"""
s.index

Int64Index([1000, 1001, 1002, 1003, 1004], dtype='int64')

In [135]:
"""If we don't assign the index then it will of length having values [0......len(data-1)]"""
pd.Series(np.random.randn(5))

0    0.833537
1   -0.388963
2    0.501565
3   -0.052195
4   -0.345565
dtype: float64

### 10.2 From dict

* If data is a dict, if index is passed the values in data corresponding to the labels in the index will be pulled out. 
* If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

In [139]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict"""
d = {'e' : 0., 'n' : 1., 'a' : 2.} # a python dict
pd.Series(d)

e    0.0
n    1.0
a    2.0
dtype: float64

In [140]:
""" In following example, index are given, so the values in data corresponding in the index will be pulled ou
t"""
pd.Series(d, index=['e', 'n', 'd', 'a'])

e    0.0
n    1.0
d    NaN
a    2.0
dtype: float64

In [141]:
# importing pandas as pd 
import pandas as pd 
  
# dictionary of lists 
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
  
df = pd.DataFrame.from_dict(dict) 
  
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [ ]:
import pandas as pd 
# dictionary of lists 
dict = {'name':["umair", "ahmad", "sudhir", "Geeku"], 
        'Job': ["Accountant", "data analyst", "engr", "backend developer"], 
        'salary':[100000, 25000, 80000, 9800000]} 
  
df = pd.DataFrame.from_dict(dict) 
df

# 11. Data Frames
- DataFrames are the workhorse of pandas and are directly inspired by the R programming language.
- Like Series, DataFrame accepts many different kinds of input:
     - Dict of 1D ndarrays, lists, dicts, or Series
     - 2-D numpy.ndarray
     - Structured or record ndarray
     - A Series
     - Another DataFrame
- Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.
- If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame.
- Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.
- If axis labels are not passed, they will be constructed from the input data based on common sense rules

# 11.1 From dict of Series or dicts
- The result index will be the union of the indexes of the various Series.
- If there are any nested dicts, these will be first converted to Series.
- If no columns are passed, the columns will be the sorted list of dict keys.

In [6]:
""" A dict is created """
d = {
 'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
 'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
 }
"""create a dataframe. row label will be the indes of a series. As coloum labels are not given so it
 will be sorted list of dict keys"""
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [7]:
""" A dict is created """
d2 = {
 'std1' : pd.Series(['chemistry', 'bio', 'phy'], index=['1', '2', '3']),
 'std2' : pd.Series(['ITC', 'PF', 'OOP'], index=['1', '2', '3'])
 }
df = pd.DataFrame(d2)
df

        std1 std2
1  chemistry  ITC
2        bio   PF
3        phy  OOP

In [11]:
""" a data frame will be constructed for given row labels"""
pd.DataFrame(d2, index=['1', '2', '3'])

        std1 std2
1  chemistry  ITC
2        bio   PF
3        phy  OOP

In [18]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [19]:
df.columns

Index(['std1', 'std2'], dtype='object')

## 11.2 From dict of ndarrays / lists
The ndarrays must all be the same length.
If an index is passed, it must clearly also be the same length as the arrays.
If no index is passed, the result will be range(n), where n is the array length.

In [20]:
"""followind examples shows that ndarray has same length"""
d = {
 'one' : [1., 2., 3., 4.],
 'two' : [4., 3., 2., 1.]
 }
"""column labels are not given so the result will be range(n), where n is the array length"""
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [22]:

dict2 = {
 'std1' : [1., 2., 3., 4.],
 'std2' : [4., 3., 2., 1.]
 }
"""column labels are not given so the result will be range(n), where n is the array length"""
pd.DataFrame(dict2)

   std1  std2
0   1.0   4.0
1   2.0   3.0
2   3.0   2.0
3   4.0   1.0

In [24]:
dict3 = {
 'std1' : [1., 2., 3., 4.],
 'std2' : [4., 3., 2., 1.],
 'std3' : [4., 3., 2., 1.]
 }
"""column labels are not given so the result will be range(n), where n is the array length"""
pd.DataFrame(dict3)

   std1  std2  std3
0   1.0   4.0   4.0
1   2.0   3.0   3.0
2   3.0   2.0   2.0
3   4.0   1.0   1.0

In [ ]:
"""If indexs are given then it would be same length as arrays"""
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

## 11.3 From a list of dicts

In [25]:
"""constructing data frame from a list of dicts"""
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [27]:
"""constructing data frame from a list of dicts"""
data3 = [{'std1': 1, 'std2': 2}, {'std1': 5, 'std2': 10, 'std3': 20}]
pd.DataFrame(data3)

   std1  std2  std3
0     1     2   NaN
1     5    10  20.0

## 11.4 From a dict of tuples
You can automatically create a multi-indexed frame by passing a tuples dictionary

In [28]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
 ('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})
#"NaN shows missing data

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [30]:
#data can be in string form
pd.DataFrame({('a', 'b'): {('A', 'B'): 'umair', ('A', 'C'): 'umair'},
 ('a', 'a'): {('A', 'C'): 'umair', ('A', 'B'): 'umair'},
 ('a', 'c'): {('A', 'B'): 'umair', ('A', 'C'): 'umair'},
 ('b', 'a'): {('A', 'C'): 'umair', ('A', 'B'): 'umair'},
 ('b', 'b'): {('A', 'D'): 'umair', ('A', 'B'): 'umair'}})
#"NaN shows missing data

         a                    b
         b      a      c      a      b
A B  umair  umair  umair  umair  umair
  C  umair  umair  umair  umair    NaN
  D    NaN    NaN    NaN    NaN  umair

## Data alignment and arithmetic
Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
Again, the resulting object will have the union of the column and row labels

In [40]:
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df + df2 # add values of respective coloumn labels

          A         B         C   D
0  0.785444  0.576489  2.895797 NaN
1 -0.223803 -1.354721  0.416988 NaN
2 -0.628345 -0.451915 -1.340527 NaN
3 -0.219341 -2.212263  1.006916 NaN
4 -0.753905 -3.229720 -2.329071 NaN
5  0.484629  1.066250  0.734740 NaN
6  0.719159 -0.275405 -0.213567 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [54]:
import numpy as np
df = pd.DataFrame(np.random.randn(10, 4), columns=['num1', 'num2', 'num3', 'num4'])
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['num1', 'num2', 'num3'])
df + df2 # add values of respective coloumn labels

       num1      num2      num3  num4
0  0.544106 -1.031078 -1.562930   NaN
1  1.583008 -0.183626 -0.550716   NaN
2 -1.945449  2.667017 -0.809509   NaN
3 -0.626624 -0.763345 -0.612854   NaN
4  0.780299  1.616593 -0.615076   NaN
5 -0.628988  0.257284  2.267217   NaN
6  2.632050 -0.629746  0.731427   NaN
7       NaN       NaN       NaN   NaN
8       NaN       NaN       NaN   NaN
9       NaN       NaN       NaN   NaN

When doing an operation between DataFrame and Series, the default behavior is to align the Series index on the DataFrame columns. For example:

In [41]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1 -0.607474 -1.695220 -2.368702  2.238531
2 -1.073322 -1.125625 -2.116291  0.614729
3 -0.708949 -1.870044 -1.421072 -0.578982
4 -1.323000 -3.082996 -4.304484  0.764278
5 -0.339181 -0.209667 -2.523478 -0.031448
6 -0.928580  0.950656 -2.381581  0.434533
7  1.138178 -0.624927 -1.682643  1.333098
8 -1.494338 -2.152229 -2.159981  2.649665
9 -1.667208 -0.674113 -2.711894  0.546111

In [56]:
#showing the location 1
df - df.iloc[1]

       num1      num2      num3      num4
0  1.057898  0.547358  0.385572 -0.779718
1  0.000000  0.000000  0.000000  0.000000
2 -1.857631  2.130805 -0.261433 -0.257600
3  0.450722  1.068357  0.505259  0.156771
4  0.643234  2.415662  2.097623  0.889274
5 -0.909265  0.586414  2.345310  1.731511
6  0.958037 -0.372738  2.442494  1.144727
7 -0.063867 -0.748344  1.204922  1.291336
8 -1.434058  2.589890  0.667039  1.176523
9  0.203647  1.934935  1.210831 -0.169616

In [42]:
df * 5 + 2
# multiply dataframe

          A          B          C          D
0  3.546539   6.863075  14.698052  -0.511036
1  0.509168  -1.613026   2.854540  10.681618
2 -1.820072   1.234952   4.116599   2.562609
3  0.001792  -2.487147   7.592691  -3.405947
4 -3.068462  -8.551906  -6.824367   3.310355
5  1.850634   5.814739   2.080659  -0.668275
6 -1.096361  11.616356   2.790148   1.661630
7  9.237428   3.738441   6.284837   6.154454
8 -3.925149  -3.898069   3.898148  12.737287
9 -4.789499   3.492511   1.138582   2.219519

In [58]:
df * 10 - 2
# multiply and subtract dataframe

        num1       num2       num3       num4
0   5.471949  -8.927118  -7.618286 -20.867167
1  -5.107032 -14.400696 -11.474003 -13.069989
2 -23.683337   6.907352 -14.088333 -15.645985
3  -0.599807  -3.717124  -6.421413 -11.502280
4   1.325304   9.755919   9.502228  -4.177253
5 -14.199681  -8.536555  11.979099   4.245124
6   4.473336 -18.128076  12.950934  -1.622717
7  -5.745705 -21.884140   0.575215  -0.156629
8 -19.447611  11.498201  -4.803612  -1.304755
9  -3.070559   4.948656   0.634308 -14.766151

In [43]:
1 / df
# divide the data frame

           A         B          C          D
0   3.233026  1.028156   0.393761  -1.991210
1  -3.353831 -1.383881   5.851104   0.575930
2  -1.308876 -6.535537   2.362281   8.887162
3  -2.502242 -1.114294   0.894024  -0.924907
4  -0.986493 -0.473848  -0.566613   3.815760
5 -33.474785  1.310706  61.989205  -1.873870
6  -1.614799  0.519947   6.327927 -14.776708
7   0.690853  2.876141   1.166905   1.203527
8  -0.843861 -0.847735   2.634147   0.465667
9  -0.736431  3.350059  -5.804380  22.777114

In [59]:
3 / df
# divide the data frame

        num1       num2       num3       num4
0   4.015017  -4.330805  -5.339706  -1.590064
1  -9.655518  -2.419219  -3.166560  -2.710030
2  -1.383551   3.368004  -2.481732  -2.198449
3  21.425622 -17.471078  -6.785161  -3.157137
4   9.021730   2.551906   2.608190 -13.778833
5  -2.459081  -4.589574   2.146061   4.803748
6   4.634396  -1.860110   2.006564  79.515817
7  -8.009173  -1.508740  11.649513  16.274535
8  -1.719433   2.222518 -10.700480  43.150283
9 -28.022739   4.317382  11.388190  -2.349964

In [44]:
df ** 5
#** represent the power dataframe's value is changed by power 5

              A          B             C          D
0  9.152998e-03   0.894878  4.159760e+01   0.063611
1  7.903785e-03   0.272649  8.531957e-04   9.089136
2  3.407267e-01   0.000548  3.211250e-02   0.000160
3  2.550838e-02   0.648636  1.565320e+00   1.366492
4  1.055905e+00  19.835524  9.701844e+00   0.004717
5  7.963955e-07   0.338828  6.772293e-08   0.081104
6  1.470707e-01  13.682396  6.236690e-04   0.000021
7  4.389925e+00   0.014614  5.393334e-01   0.476624
8  1.972046e+00   1.936240  2.077017e-02  21.266608
9  3.399937e+00   0.007939  8.810016e-04   0.000004

In [60]:
df ** 8
#** represent the power dataframe's value is changed by power 5

           num1          num2       num3          num4
0  9.715631e-02  5.301770e-02   0.009927  1.605660e+02
1  8.684914e-05  5.592018e+00   0.649035  2.255160e+00
2  4.886625e+02  3.962680e-01   4.559650  1.202373e+01
3  1.477415e-07  7.558095e-07   0.001460  6.646955e-01
4  1.495035e-04  3.647983e+00   3.063767  5.049758e-06
5  4.906680e+00  3.332663e-02  14.582546  2.313815e-02
6  3.083366e-02  4.577840e+01  24.965862  4.105271e-12
7  3.874974e-04  2.443738e+02   0.000019  1.333219e-06
8  8.587916e+01  1.102065e+01   0.000038  5.458846e-10
9  1.725382e-08  5.435085e-02   0.000023  7.054722e+00

In [45]:
#Boolean operators work as well:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [46]:
df1 & df2 #and logical operator

       a      b
0  False  False
1  False   True
2   True  False

In [48]:
df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [50]:
#negation of datafram
-df1

       a      b
0  False   True
1   True  False
2  False  False

In [61]:
#Transpose of the dataframe
# only show the first 5 rows
df[:5].T

             0         1         2         3         4
num1  0.747195 -0.310703 -2.168334  0.140019  0.332530
num2 -0.692712 -1.240070  0.890735 -0.171712  1.175592
num3 -0.561829 -0.947400 -1.208833 -0.442141  1.150223
num4 -1.886717 -1.106999 -1.364599 -0.950228 -0.217725

In [65]:
dates = pd.date_range('20130101', periods=6)
dates
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.037983 -0.790303 -0.710858 -0.149606
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071
2013-01-05 -1.030030  1.173199  1.105312 -1.288501
2013-01-06 -1.088282  0.639250  0.228390 -1.103593

Creating a DataFrame by passing a dict of objects that can be converted to series-like

In [68]:
df2 = pd.DataFrame({ 'A' : 1.,
 'B' : pd.Timestamp('20130102'),
 'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
 'D' : np.array([3] * 4,dtype='int32'),
 'E' : pd.Categorical(["test","train","test","train"]),
 'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [69]:
#Having specific dtypes
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 12. Viewing Data
We can view data / display data in different ways:
See the top & bottom rows of the frame
Selecting a single column
Selecting via [], which slices the rows
For getting a cross section using a label
Selecting on a multi-axis by labe
Showing label slicing, both endpoints are included
Reduction in the dimensions of the returned object
For getting a scalar value
For getting fast access to a scalar
Select via the position of the passed integers
By integer slices, acting similar to numpy/python
By lists of integer position locations, similar to the numpy/python style
For slicing rows explicitly
For slicing columns explicitly
For getting a value explicitly
For getting fast access to a scalar
Using a single column’s values to select data.
Selecting values from a DataFrame where a boolean condition is met.
Using the isin() method for filtering

In [70]:
df.head() #display first 5 records

                   A         B         C         D
2013-01-01 -0.037983 -0.790303 -0.710858 -0.149606
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071
2013-01-05 -1.030030  1.173199  1.105312 -1.288501

In [71]:
df.tail(3) #display last 3 records

                   A         B         C         D
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071
2013-01-05 -1.030030  1.173199  1.105312 -1.288501
2013-01-06 -1.088282  0.639250  0.228390 -1.103593

In [72]:
df.index #display indexes

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [73]:
df.columns #display coloumns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [74]:
df.values # print values

array([[-0.03798307, -0.79030315, -0.71085815, -0.14960638],
       [-0.68842018, -0.6760322 , -0.06866705, -0.22985643],
       [ 1.57537125, -0.8429837 ,  0.34850321, -0.12874242],
       [-0.16570506, -0.00880278,  1.57803859, -0.55607081],
       [-1.03002969,  1.17319945,  1.10531186, -1.28850108],
       [-1.08828155,  0.63924993,  0.22839016, -1.10359263]])

In [75]:
# Transposing your data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.037983   -0.688420    1.575371   -0.165705   -1.030030   -1.088282
B   -0.790303   -0.676032   -0.842984   -0.008803    1.173199    0.639250
C   -0.710858   -0.068667    0.348503    1.578039    1.105312    0.228390
D   -0.149606   -0.229856   -0.128742   -0.556071   -1.288501   -1.103593

In [77]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.149606 -0.710858 -0.790303 -0.037983
2013-01-02 -0.229856 -0.068667 -0.676032 -0.688420
2013-01-03 -0.128742  0.348503 -0.842984  1.575371
2013-01-04 -0.556071  1.578039 -0.008803 -0.165705
2013-01-05 -1.288501  1.105312  1.173199 -1.030030
2013-01-06 -1.103593  0.228390  0.639250 -1.088282

In [78]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-01 -0.037983 -0.790303 -0.710858 -0.149606
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071
2013-01-06 -1.088282  0.639250  0.228390 -1.103593
2013-01-05 -1.030030  1.173199  1.105312 -1.288501

In [79]:
# Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.239175 -0.084279  0.413453 -0.576062
std    0.988606  0.840799  0.820964  0.507558
min   -1.088282 -0.842984 -0.710858 -1.288501
25%   -0.944627 -0.761735  0.005597 -0.966712
50%   -0.427063 -0.342417  0.288447 -0.392964
75%   -0.069914  0.477237  0.916110 -0.169669
max    1.575371  1.173199  1.578039 -0.128742

In [80]:
#Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01   -0.037983
2013-01-02   -0.688420
2013-01-03    1.575371
2013-01-04   -0.165705
2013-01-05   -1.030030
2013-01-06   -1.088282
Freq: D, Name: A, dtype: float64

In [81]:
#Selecting a single column, which yields a Series, equivalent to df.B
df['B']

2013-01-01   -0.790303
2013-01-02   -0.676032
2013-01-03   -0.842984
2013-01-04   -0.008803
2013-01-05    1.173199
2013-01-06    0.639250
Freq: D, Name: B, dtype: float64

In [82]:
#Selecting a single column, which yields a Series, equivalent to df.C
df['C']

2013-01-01   -0.710858
2013-01-02   -0.068667
2013-01-03    0.348503
2013-01-04    1.578039
2013-01-05    1.105312
2013-01-06    0.228390
Freq: D, Name: C, dtype: float64

In [83]:
#Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01 -0.037983 -0.790303 -0.710858 -0.149606
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-03  1.575371 -0.842984  0.348503 -0.128742

In [84]:
#Selecting via [], which slices the rows.
df[1:4]

                   A         B         C         D
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071

In [85]:
#Selecting via [], which slices the rows.
df[2:4]

                   A         B         C         D
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071

In [86]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856
2013-01-03  1.575371 -0.842984  0.348503 -0.128742
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071

In [88]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.037983 -0.790303
2013-01-02 -0.688420 -0.676032
2013-01-03  1.575371 -0.842984
2013-01-04 -0.165705 -0.008803
2013-01-05 -1.030030  1.173199
2013-01-06 -1.088282  0.639250

In [89]:
#Selecting on a multi-axis by label
df.loc[:,['B','C']]

                   B         C
2013-01-01 -0.790303 -0.710858
2013-01-02 -0.676032 -0.068667
2013-01-03 -0.842984  0.348503
2013-01-04 -0.008803  1.578039
2013-01-05  1.173199  1.105312
2013-01-06  0.639250  0.228390

In [91]:
#Selecting on a multi-axis by label
df.loc[:,['A','D','C']]

                   A         D         C
2013-01-01 -0.037983 -0.149606 -0.710858
2013-01-02 -0.688420 -0.229856 -0.068667
2013-01-03  1.575371 -0.128742  0.348503
2013-01-04 -0.165705 -0.556071  1.578039
2013-01-05 -1.030030 -1.288501  1.105312
2013-01-06 -1.088282 -1.103593  0.228390

In [92]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.688420 -0.676032
2013-01-03  1.575371 -0.842984
2013-01-04 -0.165705 -0.008803

In [93]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','C']]

                   A         C
2013-01-02 -0.688420 -0.068667
2013-01-03  1.575371  0.348503
2013-01-04 -0.165705  1.578039

In [94]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['D','B']]

                   D         B
2013-01-02 -0.229856 -0.676032
2013-01-03 -0.128742 -0.842984
2013-01-04 -0.556071 -0.008803

In [95]:
# Using a single column’s values to select data.
df[df.A > 0]

                   A         B         C         D
2013-01-03  1.575371 -0.842984  0.348503 -0.128742

In [96]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C   D
2013-01-01       NaN       NaN       NaN NaN
2013-01-02       NaN       NaN       NaN NaN
2013-01-03  1.575371       NaN  0.348503 NaN
2013-01-04       NaN       NaN  1.578039 NaN
2013-01-05       NaN  1.173199  1.105312 NaN
2013-01-06       NaN  0.639250  0.228390 NaN

In [98]:
# Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.037983 -0.790303 -0.710858 -0.149606    one
2013-01-02 -0.688420 -0.676032 -0.068667 -0.229856    one
2013-01-03  1.575371 -0.842984  0.348503 -0.128742    two
2013-01-04 -0.165705 -0.008803  1.578039 -0.556071  three
2013-01-05 -1.030030  1.173199  1.105312 -1.288501   four
2013-01-06 -1.088282  0.639250  0.228390 -1.103593  three

In [99]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.575371 -0.842984  0.348503 -0.128742   two
2013-01-05 -1.030030  1.173199  1.105312 -1.288501  four